{"id":678,"date":"2019-03-02T19:31:27","date_gmt":"2019-03-02T19:31:27","guid":{"rendered":"https:\/\/adamhorne.com\/?p=678"},"modified":"2019-03-10T12:42:00","modified_gmt":"2019-03-10T12:42:00","slug":"live-muzak-transient-culture-and-the-hysterical-search-for-authenticity","status":"publish","type":"post","link":"https:\/\/adamhorne.com\/live-muzak-transient-culture-and-the-hysterical-search-for-authenticity\/","title":{"rendered":"Live Muzak: Transient culture and the hysterical search for authenticity"},"content":{"rendered":"\n<p><strong>I went to <\/strong><a rel=\"noreferrer noopener\" target=\"_blank\" href=\"http:\/\/www.welovegreen.fr\/\"><strong>We Love Green<\/strong><\/a><strong>&nbsp;on  the weekend. A music festival in a beautiful Parisian park that, I kid  you not, is usually full of peacocks. I was certainly among the older  members of the oh-so-chic, not-so-chalant crowd. And it got me thinking  about how the radical changes in how music is distributed and consumed  has had some pretty big changes to live music.<\/strong><\/p>\n\n\n\n<p><strong><em>It used to be different.<\/em><\/strong><\/p>\n\n\n\n<p>In\n the 1990&#8217;s your music was your tribe. Your identity. It’s how you told \nyour peers, and perhaps more importantly, it was like your own personal \nmuse, consistently illuminating your values to yourself. Your chosen \ngenre became your tribe. It defines your identity. An identity that \ndidn’t deviate to neighbouring musical styles. Hip-Hop guys. Grunge \nguys. Metal Guys. All different.<\/p>\n\n\n\n<p>Music\n festivals in the 1990&#8217;s started to do the genre hopping so we didn’t \nneed to. It was expensive, and hard to get full line-ups of just Hip-Hop\n to places like Perth for example, so mixing established and emerging \ngenres become <em>de rigueur<\/em>. That made it easy for hardcore genre \nfans to enjoy the other without having to compromise their integrity. \nBut honesty, most live music was big acts being opened by little acts, \nall within the same musical genre.<\/p>\n\n\n\n<p>Then\n music changed towards the end of the 1990&#8217;s. You know this story. It \nchanged because distribution from artificial scarcity to managing \nabundance. It went from $A29.95 Compact Discs that were artificially \nhigh (and at the time pretty hard to copy) to being something you copied\n as free digital files with your friends both online and offline. Then \nthe iPod. All leading to a generation of music fans who could genre-hop \nbecause of the sheer abundance of free music at their fingertips. Music \nbecome a commodity. Then it became air; everywhere and free. So that’s \ngood for normal people right…<\/p>\n\n\n\n<p><strong><em>And now?<\/em><\/strong><\/p>\n\n\n\n<p>So here are some things I noticed about live music today.<\/p>\n\n\n\n<p>I\n saw one kid in a band t-shirt. One. A white Run-D.M.C. tee on a girl. \nSelected to complete a rather fetching ensemble, I suspect, and to very \ngood effect. Just part of the look. A semiotic cultural reference, an \nicon, not an identity or affinity. But fuck, at least she wore a band \nt-shirt to a music festival.<\/p>\n\n\n\n<p>Live\n music, and its accompanying conventions really have failed to keep up \nin this schizophrenic attention economy that the internet propagated. \nForty minutes between acts on the main stage? You’re killing me. Sound \nchecking your drums again? And they still work. Now you’re killing your \nindustry. Seriously.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft\"><img loading=\"lazy\" width=\"600\" height=\"600\" src=\"https:\/\/adamhorne.com\/wp-content\/uploads\/2019\/03\/1_YYkoWoTNkHnOncs5qO8Gdw.jpeg\" alt=\"\" class=\"wp-image-681\" srcset=\"https:\/\/adamhorne.com\/wp-content\/uploads\/2019\/03\/1_YYkoWoTNkHnOncs5qO8Gdw.jpeg 600w, https:\/\/adamhorne.com\/wp-content\/uploads\/2019\/03\/1_YYkoWoTNkHnOncs5qO8Gdw-150x150.jpeg 150w, https:\/\/adamhorne.com\/wp-content\/uploads\/2019\/03\/1_YYkoWoTNkHnOncs5qO8Gdw-300x300.jpeg 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><figcaption>“Hands up with #welovegreen #orderofneverhide <a href=\"http:\/\/pic.twitter.com\/37HLFg7G8\">pic.twitter.com\/37HLFg7G8<\/a>&#8221; Via <a href=\"https:\/\/twitter.com\/KenzaSMG\">@KenzaSMG<\/a><\/figcaption><\/figure><\/div>\n\n\n\n<p>Most of the acts seemed a little too accepting to be the muzak to big picnic in the park. No one fought for my attention like <em>The Darkness<\/em>&nbsp;might, or like <em>Peaches<\/em>&nbsp;might, or <em>Björk<\/em>&nbsp;might.\n That sheer insistence on connecting just wasn’t there. Replaced with a \nnervous irony. I love irony, just don‘t hide behind it.<\/p>\n\n\n\n<p>I\n didn’t really feel a connection, a holy (or unholy) unity between me, \nthe people, the music and the musicians. No one believed it. Just, \nnothing.<\/p>\n\n\n\n<p>Conventional \nwisdom holds that the money in music is now in the delivery of live \nmusic. So they really need to start fighting harder for my conspicuous \nconsumption.<\/p>\n\n\n\n<p>Lines for the toilets are still the only really memorable part of your day.<\/p>\n\n\n\n<p>I\n didn’t see one video screen at the festival because there weren&#8217;t any. \nWhich meant about 5% of people were close enough to see what was \nhappening on stage. All I could see were some rather vulnerable looking \npeople whose stagecraft didn’t seem to make it thru customs.<\/p>\n\n\n\n<p>There’s\n a lot more young French girls in attendance than French guys. Maybe \nyoung French women define their identity by a much wider range of \ncultural consumption. Because you don’t come here for the music. You \ncome here for the organic food and the selfies.<\/p>\n\n\n\n<p>Mobile\n phone reception (or lack thereof) could kill festivals. Reception is so\n bad, cell towers so overloaded that during a music festival it requires\n the patience of a saint to post that selfie, tweet that #hashtag, or \nsend a text to your friend who couldn’t make it. The humble brag is just\n too hard. So if I can’t tell anyone just how much fun you’re having \nright now, at this exact moment, is it worth enjoying this moment right \nnow?&nbsp;<em>“Sorry, just. Trying. To get reception. What did you say? Who’s playing? Do I know this song?”<\/em><\/p>\n\n\n\n<p>The\n acts generally use a stylistically limited palette of synth sounds. \nSounds that reference the aesthetic of 1980&#8217;s pop music. But not the \nsong-craft, ethos or ideology of 80&#8217;s pop. They forgot the important \nbit. Sounds without meanings. A fashionistas soundstage that belies a \ncentral artistic anxiety — in a world where you can click, swipe and \njump to anything at any time,&nbsp;<em>what exactly do you want from us?<\/em><\/p>\n\n\n\n<p>This originally appeared on <a target=\"_blank\" href=\"https:\/\/medium.com\/@adamhorne\/live-muzak-118c23a99e0d\" rel=\"noreferrer noopener\">Medium<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I went to We Love Green&nbsp;on the weekend. A music festival in a beautiful Parisian park that, I kid you not, is usually full of peacocks. I was certainly among the older members of the oh-so-chic, not-so-chalant crowd. And it got me thinking about how the radical changes in how music is distributed and consumed [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[6],"_links":{"self":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts\/678"}],"collection":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/comments?post=678"}],"version-history":[{"count":6,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts\/678\/revisions"}],"predecessor-version":[{"id":787,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts\/678\/revisions\/787"}],"wp:attachment":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/media?parent=678"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/categories?post=678"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/tags?post=678"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}