{"id":687,"date":"2019-03-02T19:39:57","date_gmt":"2019-03-02T19:39:57","guid":{"rendered":"https:\/\/adamhorne.com\/?p=687"},"modified":"2019-03-10T12:41:41","modified_gmt":"2019-03-10T12:41:41","slug":"online-advertising-defending-free","status":"publish","type":"post","link":"https:\/\/adamhorne.com\/online-advertising-defending-free\/","title":{"rendered":"Online Advertising: Defending Free"},"content":{"rendered":"\n<p><strong>Not since Guttenberg’s invention of the printing press has anything done so much to democratised media.<\/strong><\/p>\n\n\n\n<p>From #BlackLivesMatter to The Arab Spring, good ideas, big ideas, can spread freely, all thanks to the free internet.<\/p>\n\n\n\n<p>OK. So let’s look at why “free” really is worth protecting. Even if that means championing online advertising.<\/p>\n\n\n\n<p>I promise this won’t hurt…<\/p>\n\n\n\n<p>Before\n we assess the value of retargeted advertising, we need to rewind a \nlittle, and look at the relationship between marketers, and consumers, \non the internet.<\/p>\n\n\n\n<p>So let’s look at why “free” is worth protecting. I promise this won’t hurt&#8230;<\/p>\n\n\n\n<p>Not\n since Guttenberg’s invention of the printing press has anything done so\n much to democratised media. From #BlackLivesMatter to The Arab Spring, \ngood ideas, big ideas, can spread freely, all thanks to the free \ninternet.<\/p>\n\n\n\n<p><strong>That’s because the internet is best when it’s open to as many people as possible.<\/strong><\/p>\n\n\n\n<p>For\n the vast majority of the internet, once you pay to access it (thru your\n phone company or ISPs monthly fee) it’s pretty much free to use. Search\n is free. Social media is free. News is free. Music is free. That’s not \nstrictly true. You can pay for social media (LinkedIn Premium). You can \npay for news (parts of premium publication like THe Economist and The \nWall Street Journal are behind paywalls). And you can pay for Spotify to\n get rid of the ads that play between songs.<\/p>\n\n\n\n<p>The free internet is largely paid for by advertising.<\/p>\n\n\n\n<p><strong>So it’s not really free is it?<\/strong><\/p>\n\n\n\n<p>What’s really happening is you’re paying for content on the internet with your attention.<\/p>\n\n\n\n<p>For most people, this is a really good model.<\/p>\n\n\n\n<p>It\n gives you access to insane levels of information. Want to know more \nabout German trains? Well, thanks to free services like Google Search, \nindustry publications about European trains, and blogs by trainspotters,\n and WikiPedia (with its donation \/ non-profit model) you can become an \ninstant expert. You don’t need to pay to access professional \npublications.<\/p>\n\n\n\n<p>This\n inclusivity gives the internet a network effect. That is, the more \npeople contribute tweets, articles and entire websites about German \ntrains, the more valuable the internet it is to everyone.<\/p>\n\n\n\n<p>So free access to information is important.<\/p>\n\n\n\n<p>&nbsp;How\n can advertising balance the needs of marketers to make money, in a way \nthat is respectful to users, and might make their internet experience \nbetter?<\/p>\n\n\n\n<p>&nbsp;By delivering relevant experiences.<\/p>\n\n\n\n<p>Jeff Jarvis suggests, that advertising sucks on the internet, precisely because <a target=\"_blank\" href=\"https:\/\/buzzmachine.com\/2015\/09\/07\/advertising-sucks-let-us-listicle-ways\/\" rel=\"noreferrer noopener\">it isn’t relevant<\/a>.<\/p>\n\n\n\n<p>I\n suggest that advertising retargeting, if done respectfully, and \ntransparently, can be a very good. Good for both those that use it to \nmarket their products and services, and for consumers too.<\/p>\n\n\n\n<p>Retargeting is a good start, but it’s still pretty dumb. Here’s why.<\/p>\n\n\n\n<p>&nbsp;Let’s\n say you look at a pair of Levi’s jeans for sale on a website. Just \nonce. That pair of jeans will mindlessly follow you around the web for \nweeks. What’s the half-life for the purchase of a pair of jeans? Maybe a\n week. So if you’ve not purchased new jeans a week after your first \nvisit to an online jean retailer, there’s at least a 50% chance you’re \nnot really in the market for jeans.<\/p>\n\n\n\n<p>But no. You’ll be retargeted without mercy across the web.<\/p>\n\n\n\n<p>When\n you’re bored at work and looking at fashion blogs? You’ll get an ad for\n jeans. When it’s raining and your car won’t start and you need to call a\n mechanic? It’s those jeans again. When you search for how to get red \nwine out of carpet? Yep. Jeans again… When your headache is so bad \nyou’re looking into brain cancer symptoms? Jean ads…<\/p>\n\n\n\n<p>This\n is a waste for everyone. For the consumer, it’s nauseating to see that \nsame pair of jeans all the time. On the advertisers side, they’re paying\n for ad impressions that had almost zero chance of being clicked.<\/p>\n\n\n\n<p>What\n would be better is if retargeting was coupled with other technologies \n(sentiment analysis and machine learning jump to mind). All with the aim\n to make the retargeting more relevant.<\/p>\n\n\n\n<p>So,\n to use the examples above, perhaps the only good time to see that pair \nof jeans again was when you were bored at work and browsing fashion \nblogs. And perhaps the advertiser should have stayed away from \nmechanics, brain cancer and red wine stains…<\/p>\n\n\n\n<p>And another reason why current retargeting is dumb?<\/p>\n\n\n\n<p>Were\n you to buy those jeans, there’s still a good chance you’d see that ad \nfor jeans, again. And an even better chance you’d want to burn down \ntheir jean factory!<\/p>\n\n\n\n<p>So what things should the retargeting industry do to better balance their responsibilities to users?<\/p>\n\n\n\n<ul><li>Always  anonymise personal data. Marketers should do everything to make this  data as abstract from a user’s identity as possible. It’s important to  know that I’m a man who loves volleyball, live in Stockholm, and am  looking to buy new black jeans. It’s not important for them to know my  date of birth, my passport number, or my name. They can market to me  knowing basic demographic and psychographic information<\/li><li>Encrypted  data when it’s at rest. In a world of endless hacking, leaks and  security compromises, users should expect all data about their web  browsing and purchase decisions be encrypted. So that when, not if, this  data falls into the wrong hands, it’s relatively safe<\/li><li>Treated  their practices transparently. Users have the right to know what data  is collected about them (their browsing habits and thus their  interests), why it’s being collected (to customise marketing messages),  and what the benefit is to the user (they get more relevant ads and they  get to use the internet for free<\/li><li>Make Opt-Outing easy.  It’s very important for users to have the option to opt out of  customised marketing experiences, and to receive generic marketing  messages. There’s a fraction of society that can’t compromise any level  of privacy for a better web experience. People in witness protection,  etc<\/li><li>Keep users best interest at heart. This is like the Hippocratic Oath Doctor’s take to “Do No Harm”<\/li><\/ul>\n\n\n\n<p>&nbsp;These\n are all things that online marketing have, historically, been terrible \nat. They’ve commonly overstepped all reasonable privacy. They’ve had \nmassive amounts of marketing data stolen. And perhaps most damaging of \nall to the marketing industry, they’ve never clearly articulated why \nthey do any of this in a transparent way.<\/p>\n\n\n\n<p>It matters. We need to get this right.<\/p>\n\n\n\n<p><strong>For marketers it matters.<\/strong><\/p>\n\n\n\n<ul><li>It matters that they to stop wasting money on useless ad impressions.<\/li><li>It matters they demand consumer attention when they’re useful to that consumer.<\/li><li>It matters that we move a higher percentage of consumer spending online.<\/li><li>It matters that we respect our customers.<\/li><\/ul>\n\n\n\n<p><strong>And for consumers it matters.<\/strong><\/p>\n\n\n\n<ul><li>It matters that the web stays free and open so that billions more people can join the conversation.<\/li><li>It matters that our attention isn’t wasted on stuff that can’t help us.<\/li><li>It matters that we have some control over our digital footprints.<\/li><li>It matters that the internet is fast and useful.<\/li><li>It matters that we stop seeing that God Damn jeans ad before we kill ourselves!<\/li><\/ul>\n\n\n\n<p><em>Note:\n This is an essay I wrote defending web advertising (!!!) for Digital \nAnalytics for Marketing Professionals course I took thru University of \nIllinois &amp; Coursera. It was originally published on <a target=\"_blank\" href=\"https:\/\/www.linkedin.com\/pulse\/defending-free-adam-horne\/\" rel=\"noreferrer noopener\">LinkedIn<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Not since Guttenberg’s invention of the printing press has anything done so much to democratised media. From #BlackLivesMatter to The Arab Spring, good ideas, big ideas, can spread freely, all thanks to the free internet. OK. So let’s look at why “free” really is worth protecting. Even if that means championing online advertising. I promise [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[6],"_links":{"self":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts\/687"}],"collection":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/comments?post=687"}],"version-history":[{"count":2,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts\/687\/revisions"}],"predecessor-version":[{"id":689,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts\/687\/revisions\/689"}],"wp:attachment":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/media?parent=687"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/categories?post=687"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/tags?post=687"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}