{"id":690,"date":"2019-03-02T19:41:56","date_gmt":"2019-03-02T19:41:56","guid":{"rendered":"https:\/\/adamhorne.com\/?p=690"},"modified":"2019-03-10T12:41:19","modified_gmt":"2019-03-10T12:41:19","slug":"apple-staying-smart","status":"publish","type":"post","link":"https:\/\/adamhorne.com\/apple-staying-smart\/","title":{"rendered":"Apple: Staying Smart"},"content":{"rendered":"\n<p><strong>TL;DR  &#8211; The future of computing is smarter, cloud based services, running on  commodity hardware. Not expensive hardware running integrated software.  Apple is not positioned well for this. But maybe the power of their  brand can save them.<\/strong><\/p>\n\n\n\n<p>Using an explanation of Apple’s assets, \nboundaries, and narrative, I’ll explain why it&#8217;s causing them to make \nhuge missteps when it comes to preempting the future of computing.<\/p>\n\n\n\n<p><strong>Apple’s Assets:<\/strong><\/p>\n\n\n\n<ul><li>The world’s most valuable company has a veritable riches of assets. They include:<\/li><li>A reputation of being the best designed objects in computing<\/li><li>A reputation of solving complicated technical and interface problems in the most humanistic way<\/li><li>The world’s most sophisticated production supply chain, capable of developing beautifully designed objects, at huge scale<\/li><li>A reputation for being high-desirable consumer electronics that convey high levels of social status<\/li><li>A reputation and long history of integrating hardware and software effortlessly<\/li><li>An instinct for taking immature technology and creating products that revolutionize the category<\/li><li>A reputation and history of protecting user data and privacy above all else<\/li><li>A network of retail stores where consumers can fixate upon, and fix, their products<\/li><li>An increasing reputation as a fashion brand<\/li><\/ul>\n\n\n\n<p><strong>Apple’s Boundaries<\/strong><\/p>\n\n\n\n<ul><li>Never use personally recognizable data to train machine learning systems<\/li><li>Never compete on price and become a commodity player<\/li><li>Maintain high profit margins and price per unit numbers<\/li><li>Lower design or manufacturing standards<\/li><li>Champion anything other than reductive and minimal design<\/li><li>Make large acquisitions and blend corporate culture<\/li><li>Invest heavily in things that don’t quickly develop into products<\/li><li>Not compelled to enter every market<\/li><li>A commitment that all Apple products reinforce the Apple ecosystem<\/li><\/ul>\n\n\n\n<p><strong>Apple’s Narrative<\/strong><\/p>\n\n\n\n<p>To discover Apple’s narrative, it helps to look at how they define their mission statement.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&#8220;Apple\n is committed to bringing the best personal computing experience to \nstudents, educators, creative professionals and consumers around the \nworld through its innovative hardware, software and Internet offerings.&#8221;<\/p><\/blockquote>\n\n\n\n<p>I\n think internally they see their mission statement as “By making \ndifficult decisions on behalf of users and carefully curating the \nexperience, Apple is committed to bringing the best personal computing \nexperience to students, educators, creative professionals and consumers \naround the world through its innovative hardware, software and Internet \nofferings[Italics added]”<\/p>\n\n\n\n<p><strong>This exposes a clear gap between:<\/strong><\/p>\n\n\n\n<ul><li>Industry\n trends, which place a lot of faith in machine learning systems trained \nwith user data to become smarter and more useful as personal assistant \nser<\/li><li>User’s real world approach to privacy, which is strict when \nasked, and soft when it comes to forgoing services that use their data \n(Facebook, Google, etc)<\/li><li>Apple’s raison d&#8217;etre, to “bringing the best personal computing experience”<\/li><li>I\n think the companies that best exploit machine learning, and develop \nartificial intelligence, peripheral to personal devices, will have the \nbrightest future.<\/li><\/ul>\n\n\n\n<p>I don’t think Apple are well poised to capitalize on this.<\/p>\n\n\n\n<p><em>This is a piece I wrote as part of my <a target=\"_blank\" href=\"https:\/\/altmba.com\/\" rel=\"noreferrer noopener\">altMBA program<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>TL;DR &#8211; The future of computing is smarter, cloud based services, running on commodity hardware. Not expensive hardware running integrated software. Apple is not positioned well for this. But maybe the power of their brand can save them. Using an explanation of Apple’s assets, boundaries, and narrative, I’ll explain why it&#8217;s causing them to make [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[6],"_links":{"self":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts\/690"}],"collection":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/comments?post=690"}],"version-history":[{"count":1,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts\/690\/revisions"}],"predecessor-version":[{"id":691,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts\/690\/revisions\/691"}],"wp:attachment":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/media?parent=690"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/categories?post=690"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/tags?post=690"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}