{"id":866,"date":"2019-11-19T18:46:36","date_gmt":"2019-11-19T18:46:36","guid":{"rendered":"http:\/\/adamhorne.com\/?p=866"},"modified":"2019-11-19T18:48:45","modified_gmt":"2019-11-19T18:48:45","slug":"choosing-a-creative-concept","status":"publish","type":"post","link":"https:\/\/adamhorne.com\/choosing-a-creative-concept\/","title":{"rendered":"From many, one. Choosing the right creative concept."},"content":{"rendered":"\n<p><strong>It should be easy, instinctive, and stress-free. How hard can it be to choose the best concept? In my experience, it’s very challenging.  It&#8217;s also where many tool-kits, processes, and systems defer back to you. <\/strong><\/p>\n\n\n\n<p>However, it’s one of the most critical parts of a successful campaign. And you&#8217;re on your own. According to Harvard Business Review, “a euro invested in a highly creative ad campaign had nearly double the sales impact of a euro spent on a non-creative campaign.”<a href=\"#_ftn1\"><sup>[1]<\/sup><\/a><\/p>\n\n\n\n<p>In many ways it’s more difficult selecting the right idea than it is having the right idea. Here is some advice for helping you choose the right creative concept.<\/p>\n\n\n\n<p><strong>Get\nclear<\/strong><\/p>\n\n\n\n<p>Give yourself some time between any concept\ndevelopment you and your team have done and choosing your creative campaign.\nEven a day or two will help make decisions about the merits of the work much\nmore manageable.<\/p>\n\n\n\n<p><strong>The\nSMP and creative brief will guide you<\/strong><\/p>\n\n\n\n<p>Your original creative brief is the best\nsingle document you have by which to measure creative concepts. Ask yourself\nthe following questions:<\/p>\n\n\n\n<ul><li>Does the creative concept deliver on the single-minded proposition\n(SMP), or is it communicating something different?<\/li><li>Can the creative concept be executed faithfully and powerfully in\nthe channels we’ve selected?<\/li><li>Can it be executed well given the constraints of our budget and\ntimeline?<\/li><li>Is it rewarding for your audience or a waste of their time?<\/li><\/ul>\n\n\n\n<p><strong>Understand\nyour different audience and their needs<\/strong><\/p>\n\n\n\n<p>It’s very important that when developing\nyour campaign, you keep in mind the fact that you will need to develop three\nsuites of communication, for your three audiences. It’s very easy to develop a\ncreative concept that favours one of your audiences and compromises the others.\nKeep this in mind when making your decision. <\/p>\n\n\n\n<p><strong>Seek\nopinions<\/strong><\/p>\n\n\n\n<p>It’s essential to get new perspectives on\ncreative concepts. It will help mitigate problems you’re blind to and help you\nsee the work from more subjective positions. However, when confronted, many\npeople feel the need to react rationally, that is, in a way that can be\nlogically defended. To critique work logically is to deny the emotive qualities\nof a creative concept. Stay mindful of this.<\/p>\n\n\n\n<p>It’s also a good idea to ask your audience\nwhat they think. The power of the creative concept to affect change in your\naudience is, in conclusion, the only thing that matters. You can do this with\nfocus groups or surveys, but again, you risk your audiences reacting rationally\nto work and thus skewing the analysis. A better way is to test campaign\nelements in context and in-market.<\/p>\n\n\n\n<p><strong>Accept\nthe impossibility of a perfect decision<\/strong><\/p>\n\n\n\n<p>You must choose the creative concept that\nyou think and feel will be the most effective. It’s a decision made with\nimperfect information. However, it’s better to choose a good creative concept\nearlier than a better creative concept later. That’s because the quality of the\nidea is only as good as the execution of the idea, and all ideas take more time\nto execute well that you might initially think.<\/p>\n\n\n\n<p><strong>Shun\ndemocracy<\/strong><\/p>\n\n\n\n<p>Democracy might feel like a fair way of\nchoosing a creative concept, but generally, it’s at the expense of an effective\ncampaign. Groups of people tend to select creative concepts that nobody hates.\nWhich is to say they choose things that very few people are captivated by. It’s\nbetter to choose a creative campaign that people react strongly to (hopefully\npositively), than a campaign that’s easy to ignore. Don’t forget that you’re\nprimarily fighting for attention.<\/p>\n\n\n\n<p><strong>It\nextends painlessly<\/strong><\/p>\n\n\n\n<p>One typical quality of good creative\ncampaign is their ability to extend out into all media, platforms, executions,\nand audiences. If a concept works well from long-form video, Instagram posts,\npress releases, etc. and can be executed for professionals as well as the\npublic, then you should feel confident that your creative concept is in fact, a\ncreative platform for your entire campaign.<\/p>\n\n\n\n<p><strong>It’s\nrefreshing<\/strong><\/p>\n\n\n\n<p>Your creative concept should not be\nentirely predictable. It should challenge the conventions of the public-health\ncategory if it’s to get the attention it deserves. Nobody on the internet is\nlooking to engage with predictable and uninspired content or communication.\nRespect your audience and don’t burden them with boring.<\/p>\n\n\n\n<p><strong>It’s\na bit scary<\/strong><\/p>\n\n\n\n<p>If it doesn’t feel a little bit dangerous,\nthen you might be backing a creative concept that’s so safe that it might be\nineffective. However, support yourself. Choose a strong creative concept and\nthen move your attention into execution it with confidence.<\/p>\n\n\n\n<p><strong>Don’t\ncreate a monster<\/strong><\/p>\n\n\n\n<p>When considering the merits of different\ncreative concepts, it’s common to want to take the best parts of different\nconcepts and Frankenstein them into a new campaign. That is almost always a bad\nidea and yields a confusing mix of ideas that all compromise each other.\nInstead, choose one idea and do it well. Or else you’ll burden your audience\nwith a horse-cat, dog-pony, of whale-goat.<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p><a href=\"#_ftnref1\"><sup>[1]<\/sup><\/a> https:\/\/hbr.org\/2013\/06\/creativity-in-advertising-when-it-works-and-when-it-doesnt<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It should be easy, instinctive, and stress-free. How hard can it be to choose the best concept? In my experience, it’s very challenging. It&#8217;s also where many tool-kits, processes, and systems defer back to you. However, it’s one of the most critical parts of a successful campaign. And you&#8217;re on your own. According to Harvard [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[6],"_links":{"self":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts\/866"}],"collection":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/comments?post=866"}],"version-history":[{"count":3,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts\/866\/revisions"}],"predecessor-version":[{"id":869,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/posts\/866\/revisions\/869"}],"wp:attachment":[{"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/media?parent=866"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/categories?post=866"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/adamhorne.com\/wp-json\/wp\/v2\/tags?post=866"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}